tap "bysiber/cleardisk"
tap "facebook/fb"
tap "homebrew/bundle"
tap "homebrew/services"
tap "oven-sh/bun"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Statistics utility to count lines of code
brew "cloc"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Modern, maintained replacement for ls
brew "eza"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Ruby version manager
brew "rbenv"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Free, open-source macOS app to find and clean developer caches
cask "bysiber/cleardisk/cleardisk"
# Universal database tool and SQL client
cask "dbeaver-community"
# Reimagine your terminal
cask "fig"
# Desktop debugging platform for mobile developers
cask "flipper"
# Multimedia player
cask "vlc"
# OpenJDK distribution from Azul
cask "zulu@11"
# OpenJDK distribution from Azul
cask "zulu@17"
vscode "alefragnani.rtf"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "bierner.markdown-preview-github-styles"
vscode "bmuskalla.vscode-tldr"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "douglaszaltron.nunjucks-vscode-extensionpack"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "eseom.nunjucks-template"
vscode "expo.vscode-expo-tools"
vscode "figma.figma-vscode-extension"
vscode "genuitecllc.codetogether"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "grapecity.gc-excelviewer"
vscode "janisdd.vscode-edit-csv"
vscode "jsynowiec.vscode-insertdatestring"
vscode "kameshkotwani.google-search"
vscode "lokalise.i18n-ally"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "meronz.manpages"
vscode "midudev.better-svg"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "okitavera.vscode-nunjucks-formatter"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ronnidc.nunjucks"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "wayou.vscode-todo-highlight"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
npm "cordova"
npm "corepack"
npm "mint"
npm "n"
npm "react-native-vlc-media-player"
