tap "facebook/fb"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "oven-sh/bun"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "apktool"
brew "bash"
brew "bat"
brew "cloc"
brew "cocoapods"
brew "exa"
brew "openjpeg"
brew "ghostscript"
brew "git"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "gradle"
brew "htop"
brew "httpie"
brew "libheif"
brew "imagemagick"
brew "ios-deploy"
brew "nginx"
brew "rbenv"
brew "rename"
brew "thefuck"
brew "tldr"
brew "tree"
brew "watchman"
brew "wget"
brew "facebook/fb/idb-companion"
brew "oven-sh/bun/bun"
cask "dbeaver-community"
cask "fig"
cask "flipper"
cask "vlc"
cask "zulu11"
cask "zulu17"
vscode "alefragnani.rtf"
vscode "bierner.markdown-preview-github-styles"
vscode "bmuskalla.vscode-tldr"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "douglaszaltron.nunjucks-vscode-extensionpack"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "eseom.nunjucks-template"
vscode "figma.figma-vscode-extension"
vscode "genuitecllc.codetogether"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "janisdd.vscode-edit-csv"
vscode "jsynowiec.vscode-insertdatestring"
vscode "kameshkotwani.google-search"
vscode "lokalise.i18n-ally"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "meronz.manpages"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "okitavera.vscode-nunjucks-formatter"
vscode "redhat.java"
vscode "ronnidc.nunjucks"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "wayou.vscode-todo-highlight"
vscode "withfig.fig"
vscode "yzhang.markdown-all-in-one"
