tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "bash"
brew "bat"
brew "exa"
brew "git"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "htop"
brew "python@3.10", link: false
brew "httpie"
brew "imagemagick"
brew "nginx"
brew "python@3.11", link: false
brew "rename"
brew "thefuck"
brew "tldr"
brew "tree"
brew "wget"
cask "fig"
cask "vlc"
